{
  "education": [
    {
      "awards_achievements": null,
      "degree": "Honours Bachelor of Science in Computer Science",
      "department": "Lassonde School of Engineering",
      "duration": "2018-2023",
      "school_name": "York University"
    }
  ],
  "github_repo_root_url": "https://github.com/jarviscanada/jarvis_data_eng_VikramjeetGill",
  "highlighted_projects": [
    {
      "description": "Created interactive web app that serves as an encyclopedia for the 5th generation of Pokémon to develop HTML, CSS, JavaScript, and other web development skills. Used React and Bootstrap frameworks for frontend to develop the user interface.",
      "git_url": "https://github.com/Vikramjeet-Gill/Unova_Pokedex",
      "name": "Unova Pokedex"
    },
    {
      "description": "Created a web store as a full stack development exercise. Primarily used Java, Angular, and TypeScript. Created a database using SQL. Used AWS for hosting. Store functionality included account creation, a functioning cart and checkout system etc...",
      "name": "Furniture Store E-Commerce Platform"
    }
  ],
  "jarvis_projects": [
    {
      "description": [
        "Developed a series of bash scripts designed to capture host hardware specification data and host hardware resource usage data and update and report said usage data on a minute by minute basis.",
        "host_info.sh captures host hardware specification data and host_usage.sh captures resource usage data. psql_docker.sh is used to interact with and manage the required docker container",
        "Used PostgreSQL for database management and to store collected information."
      ],
      "git_url": "/linux_sql",
      "name": "Cluster Monitor"
    },
    {
      "description": [
        "Developed a Java application that mimics the functionality of the grep command",
        "The app works by recursively building a list of files in the provided source directory and all subdirectories and then reading the lines from those files and adding matching lines to the output file.",
        "Used Maven for dependency management. Used Docker for deployment."
      ],
      "git_url": "/core_java/grep",
      "name": "Java Grep"
    },
    {
      "description": [
        "Created an API with Spring to manage and access the customer data of an insurance agency. Functionality includes adding customers, finding customers by ID, deleting customers, updating existing an customer's data, and more.",
        "Used Spring MVC framework for application development. Used Spring Data for automatic implementation of basic CRUD methods and provided custom implementations for more complex methods.",
        "Used Maven for dependency management. Used MongoDB for database management. Used Postman for application testing."
      ],
      "git_url": "/mongo",
      "name": "Insurance API"
    }
  ],
  "name": "Vikramjeet Gill",
  "others": [
    {
      "bullets": [
        "Marathon Runner (cardiovascular health is very important to me and running a marathon is a stepping stone to more impressive athletic feats like the Spartan Race or a triathlon which I hope to do one day)",
        "Powerlifter (Building strength and muscle is very important to me since they are useful for pretty much all athletic pursuits and for remaining healthy)",
        "Reading (I have always been an avid fan of science fiction and fantasy books such as The Expanse series and ASOIAF series and so I make an effort to always be reading at least one book a month)"
      ],
      "title": "Activities/Hobbies"
    }
  ],
  "professional_experience": [
    {
      "company": "Jarvis",
      "description": "Built multiple applications both for internal use and for clients. Applied the Agile framework implementation Scrum to coordinate with team members to produce software. Utilized PostGreSQL to design database for internal applications.",
      "duration": "November 2023 - present",
      "title": "Software Developer"
    },
    {
      "company": "Software For Love",
      "description": "Utilized React, Bootstrap, and other front-end frameworks to develop user interfaces for client websites. Applied UI and UX design principles to design client websites. Worked with a team of over a dozen other developers and designers to develop software solutions for clients.",
      "duration": "May 2023 - September 2023",
      "title": "Software Developer"
    },
    {
      "company": "York University",
      "description": "Managed a team of over 30 employees and volunteers to provide academic advising and student support services to computer science and engineering students. Planned and lead academic orientation events for over 400 first year computer science, digital media, and engineering students. Organized learning skills workshops, Leetcode practice sessions, and faculty panels. Wrote Python scripts to analyze student related data.",
      "duration": "September 2022 - April 2023",
      "title": "Student Success Mentor Lead"
    }
  ],
  "skills": {
    "competent": [
      "Python",
      "React",
      "NodeJS",
      "Bootstrap",
      "Javascript"
    ],
    "familiar": [
      "Angular",
      "Typescript",
      "C++",
      "AWS",
      "C"
    ],
    "proficient": [
      "Java",
      "Linux/Bash",
      "RDBMS/SQL",
      "Agile/Scrum",
      "Git"
    ]
  },
  "summary": "My name is Vikramjeet Gill. I am a recent graduate of York University and I have a bachelor's degree in Computer Science. I am a software developer here at Jarvis and during this role I have honed several key technical skills by working on projects both for internal use and client projects. In this role I have used Java, PostgreSQL, bash scripting, and various other technologies. Before working at Jarvis I worked for a nonprofit called Software For Love mostly doing front-end work designing websites for clients including charities where I applied my knowledge of front-end technologies and frameworks like React and Bootstrap to build the user interfaces of the client websites. Before that, I was working as a student success mentor lead at York where I was responsible for managing our Peer Helper program and leading a team of over 30 people. What excites me the most about the software development industry is the opportunity to work on software solutions that will have a direct positive impact on people's lives. Software solutions have been at the forefront of revolutionizing finance, transportation, healthcare, and many other sectors and so as a software developer you can be assured that your work is having an impact and changing people's lives for the better."
}
